# AirSystemData Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
AirSystemData Class
Members See Also
---
Represents the data and parameter of analytical air system.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public class AirSystemData : IDisposable
```

Visual Basic
---
```text
Public Class AirSystemData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class AirSystemData : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Mechanical..::..AirSystemData
# See Also
AirSystemData Members
Autodesk.Revit.DB.Mechanical Namespace